**** test
     #+begin_src lisp :results output :export code :tangle tests/gagm-tests.lisp
     (let* ()
       (format t "~%Testing print-object keys:~%")
  
       (update-left-key "<")
       (format t "Left key for print-object: ~a (expect >)~%"
               print-object-left-key)
  
       (format t "Right key for print-object: ~a~%"
               print-object-right-key)
       (update-right-key ">")
       (format t "Rigth key for print-object: ~a (expect >)~%"
               print-object-right-key)

  
       (update-key "[" "]")
       (format t "Left key for print-object: ~a (expect [)~%"
               print-object-left-key)
       (format t "Right key for print-object: ~a (expect ])~%"
               print-object-right-key)

       (set-print-object-keys-to-default)
       (format t "Left key for print-object: ~a (expect ~a)~%"
               print-object-left-key
               ,*default-print-object-left-key*)
       (format t "Right key for print-object: ~a (expect ~a)~%"
               print-object-right-key
               ,*default-print-object-right-key*)

       )
     #+end_src

     #+RESULTS:
     : Left key for print-object: (
     : Rigth key for print-object: )
**** test
     #+begin_src lisp :results output :export code :tangle tests/gagm-tests.lisp
       (let* ()
         (format t "Standard-print-object for a person with name and age:
     ~a~%"
                 (standard-print-object 'person '(name age) " " "~a")))
     #+end_src

     #+RESULTS:
     : standard-print-object for a person with name and age:
     : (PERSON (NAME ~a) (AGE ~a) )
**** test
     #+begin_src lisp :results output :export code :tangle tests/gagm-tests.lisp
     (let* ((test-data '((1 2 3 4) (5 6) (7) 8)))
       (format t "first element in ~a:~%~17t~a~%"
               test-data
               (only-first-element-in-list test-data)))  
     #+end_src

     #+RESULTS:
     : first element in ((1 2 3 4) (5 6) (7) 8):
     :                  (1 5 7 8)
